[{
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 50,
  "name": "The Gimp",
  "description": "More a creature of leather than of flesh, this grunting sub is barely a character in any classic sense. But what a presence! This permanent resident of a scuzzy pawn-shop dungeon —by choice, maybe?— is a neon sign proclaiming “shit’s about to get WEIRD.” Message received, Gimp."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 49,
  "name": "Mr. Brown",
  "description": "The cast of “Reservoir Dogs” features a stellar cast of character actors, but who gets the first line? Tarantino himself, as a criminal sideman whose principal contribution to the movie is a vulgar monologue about Like a Virgin. Even if you can’t remember another thing he says, that opening is crucial as a statement of purpose not just for this film, but for Tarantino’s career."
}, {
  "movie": "From Dusk Till Dawn",
  "year": 1996,
  "rank": 48,
  "name": "Seth Gecko",
  "description": "This coldly calculating, smoky-eyed killer could have been merely the sober straight man to his demented brother in the film, but Tarantino and Robert Rodriguez landed George Clooney for the role. The future big-time movie star, then “merely” a small-screen heartthrob on E.R., amplified Seth’s charms, creating an unlikely pulp horror anti-hero."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 47,
  "name": "Captain Koons",
  "description": "It’s not so difficult to leave an indelible mark on an audience; all it takes is a story about hiding an uncomfortable hunk of metal up your ass for years. Tarantino’s characters can be impossible to differentiate from the performances that lift them off the page, and Christopher Walken’s performance as a war hero-turned-fairy godfather is a pristine example of character and actor intertwined."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 46,
  "name": "Fredrick Zoller",
  "description": "This kid got lucky, if by “lucky” you count killing hundreds of enemy soldiers with one rifle while taking refuge in a tower (perversely, the model for Zoller is US Army veteran Audie Murphy). Heralded as a model of Nazi determination by Goebbels, Zoller lets his war hero status go to his head. He’s not creepy because he’s a Nazi, but because he wields his fame like a weapon against Shoshanna."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 45,
  "name": "K-Billy DJ",
  "description": "We don’t even need to see Steven Wright. His nasally sonorous voice and snail’s-pace delivery fleshes out this disembodied DJ just fine. Wright’s on-air rambling —“chatter” would imply a velocity he never achieves— is a sort of set dressing that paints in the sundown ‘70s vibe of Tarantino’s imagined world. Thanks in part to the soundtrack release, which featured Wright’s intros along with the songs, we can’t imagine this story without him."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 44,
  "name": "Bridget von Hammersmarck",
  "description": "A German silver-screen star turned spy for the Allies attempts to make the best of a bad situation, going so far as to pursue a foolish ruse with a gunshot leg. The bonehead Basterds, after all, may be crack commandoes on the battlefield, but they have a few handicaps in more subtle situations. You’ve gotta admire this agent’s guts, as she’s obviously screwed the moment she steps into the Nation’s Pride premiere."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 43,
  "name": "Major Hellstrom",
  "description": "The very image of an imposing SS Officer, Hellstrom is a worryingly perceptive Nazi. His grim intensity suggests he is capable of lightning-quick bursts of violence long before we see his skills in acton. He’s like an experimental machine designed to generate high-test suspense. That, combined with a tendency towards perverse humor, makes him a potent force even in small doses."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 42,
  "name": "Joe Cabot",
  "description": "Off-screen bruiser and alcoholic Lawrence Tierney brings rumpled cred to Tarantino’s gangster debut. At his advanced age, the hair-trigger irritability of this growling crime boss no longer always explodes into violence, but he’s still got Eddie and Vince Vega around as muscle. And as the film’s conclusion shows, Joe remains a cold-blooded triggerman at heart."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 41,
  "name": "Honey Bunny",
  "description": "There are only two women in “Reservoir Dogs” —both are briefly-seen carjacking victims— but Tarantino opens his followup with this intriguing bundle of nerves who can swing on a dime from intently perceptive to viciously confrontational. With only a few minutes and a handful of lines, Amanda Plummer turns this small-time criminal into one of Pulp Fiction’s most memorable personalities."
}, {
  "movie": "From Dusk Till Dawn",
  "year": 1996,
  "rank": 40,
  "name": "Ritchie Gecko",
  "description": "Quentin Tarantino is in most of his films, but this pervy creepazoid is the most complete character he’s ever played. That Ritchie connects so directly to public assumptions about Tarantinto’s personality only makes him more memorable and uncomfortably effective."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 39,
  "name": "Lt. Archie Hicox",
  "description": "Film critic characters tend to be objects of ridicule, but Hicox breaks that pattern. He’s smart, cautious and capable, and even earns sympathy for the seemingly minor mistake that proves to be his undoing. Michael Fassbender, then still an emerging art-house star (he was not Tarantino’s first choice for the role), gives Hicox a perfectly proper demeanor."
}, {
  "movie": "Kill Bill: Volume One",
  "year": 2003,
  "rank": 38,
  "name": "Hattori Hanzo",
  "description": "This swordsmith’s name looms over Kill Bill, and his endorsement of Beatrix and her mission, while not exactly necessary, is obviously a big deal to the “yellow-haired warrior” Bride. Tarantino has paid homage to actor Sonny Chiba in past films, so Chiba’s appearance as the master —based on a real historic figure whom Chiba had played several times in other films— represents Kill Bill going full circle."
}, {
  "movie": "Jackie Brown",
  "year": 1997,
  "rank": 37,
  "name": "Louis Gara",
  "description": "Robert De Niro’s near-total disconnection from recognizable emotion in this role make the recent parolee realistically terrifying as he sits around Ordell Robbie’s house like a piece of human furniture. His quiet demeanor conceals a wounded touchiness that explodes into violent anger, and this dull-witted goon is more likely to put a bullet in your chest than cop to his own shortcomings."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 36,
  "name": "Nice Guy Eddie",
  "description": "Not unlike Louis Gara, Joe Cabot’s son is easygoing until friends or family are threatened, and his casual thuggishness and racism go nuclear. Eddie is a creep, and a frightening one, like so many “regular guys” whose affable exterior barely conceals a roiling fury."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 35,
  "name": "Fabienne",
  "description": "One of the subtle touches in Pulp Fiction is the lingering “is Fabienne pregnant?” question. It’s an easy-to-miss aspect of the woman who puts up with Butch’s mood swings and mansplaining. Fabienne has her own thing going on; rather than being a stock girlfriend character, she’s clearly has her own inner life, giving an extra poignancy to her few scenes."
}, {
  "movie": "Death Proof",
  "year": 2007,
  "rank": 34,
  "name": "Stuntman Mike",
  "description": "Casting Kurt Russell as a crybaby killer whose problems with women are expressed in domination and violence is a supreme act of cinematic trolling (Mickey Rourke was originally set for the part). What first seems like Tarantino’s most perverse and puzzling character comes into focus as a brutal cartoon critique of horrible dudebro entitlement."
}, {
  "movie": "From Dusk Til Dawn",
  "year": 1996,
  "rank": 33,
  "name": "Earl McGraw",
  "description": "Michael Parks plays this Texas sheriff in multiple films (“Kill Bill,” both “Grindhouse” halves, and “From Dusk Till Dawn,” where he seems to meet his end), with Parks’s real-life son playing the character’s own child. Earl looks like a stereotypical slow-drawl lawman, but he’s not quite a simplistic shitkicker. Calm and perceptive, he’s a surprisingly comforting presence."
}, {
  "movie": "Kill Bill: Volume One",
  "year": 2003,
  "rank": 32,
  "name": "Gogo Yubari",
  "description": "O-Ren Ishii’s teen bodyguard is more than slightly deranged, and her mental instability is compounded by a vicious skill with a unique weapon. Created as a big homage to the film “Battle Royale,” Gogo distinguishes herself in one of the most brutal fight scenes in a pair of films thick with impressive combat."
}, {
  "movie": "Django Unchained",
  "year": 2012,
  "rank": 31,
  "name": "Dr. King Schultz",
  "description": "What if Christoph Waltz brought his Hans Landa charm to the screen with none of the complications that arise from creating affinity for a Nazi? Schultz goes slightly beyond the “white savior” stereotype, but is still a heavily idealized type whose only flaws are that affinity for killing (but it’s justified!) and a tendency to impulsively act on principle."
}, {
  "movie": "True Romance",
  "year": 1993,
  "rank": 30,
  "name": "Drexl",
  "description": "Not one to let a wig and makeup do all the work, Gary Oldman focused all the lunges and jitters of his hyper-physical period into this trigger-happy dirtbag. The irony of seeing such a gross character blatantly appropriate aspects of black culture isn’t lost on us in light of one of the most prominent criticisms levied at his creator."
}, {
  "movie": "True Romance",
  "year": 1993,
  "rank": 29,
  "name": "Clifford Worley",
  "description": "In a fast-paced film wearing an oversized heart on its sleeve, Clarence Worley’s father Clifford brings a bit of genuine pathos. Tarantino may not have cast or directed “True Romance,” but Dennis Hopper seems like the choice he would have made, and Hopper’s gruff and honest paternal figure is surprising and welcome, even when he gets nasty provoking the gangster played by Christopher Walken."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 28,
  "name": "Aldo Raine",
  "description": "We’ve seen weirder things than an Alabama hillbilly leading an all-Jewish squad of Nazi killers, but Brad Pitt’s exaggerated accent pushes this Army officer fully into a cartoonish realm. Raine’s anti-facist exuberance is infectious, but he really gets interesting when, dismally under-prepared, he infiltrates the very core of the political force he hates."
}, {
  "movie": "True Romance",
  "rank": 27,
  "name": "Vincenzo Coccotti",
  "description": "In one sequence, thanks in no small part to a pitch-perfect performance from Christopher Walken, this mobster is enshrined as one of the unforgettable silver screen gangsters. Who else could deliver “You’re a cantaloupe!” with such panache? Coccotti is showy with articulation of his own dangerous nature, but Blue Lou Boyle’s consul doesn’t hesitate to back up his talk."
}, {
  "movie": "Jackie Brown",
  "year": 1997,
  "rank": 26,
  "name": "Ordell Robbie",
  "description": "He’s ambitious and determined, but this small-time gun runner isn’t nearly as smart as he thinks he is. Samuel L. Jackson nails Robbie’s demeanor, keeping us hooked with snappy patter while revealing just enough vulnerability to make his failures even more satisfying than his brief moments of success."
}, {
  "movie": "Kill Bill: Volume One",
  "year": 2003,
  "rank": 25,
  "name": "O-Ren Ishii",
  "description": "This top Tokyo crime lord climbed to her gangland leadership position over a hill of bodies, but the commanding and ruthless assassin is not without some lingering glimmers of compassion for her old compatriot. Implications of serious friendship between O-Ren and Beatrix Kiddo add depth to the first heavy antagonist in Kill Bill, and O-Ren’s elegant end is as respectful as the violent story gets."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 24,
  "name": "Mr. Blonde",
  "description": "We’re told about more of Blonde’s out of control violence than we actually see, but even before White and Pink are cowed and angered by his diamond heist shooting spree, we’ve seen Michael Madsen use an empty stare and charming smile to create a deeply disconnected sociopath. He’s among the most authentic villains in Tarantino’s films, and possibly the most frightening."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 23,
  "name": "Butch",
  "description": "This Bruce Willis character riffs on an old film noir trope: the fighter who has a plan to rip off domineering bookmakers. Yet Tarantino pushes him into weird territory, making what felt like a very familiar character part of the film’s most bizarre turn. Events in the sadist’s basement also gives Butch a chance to show his true character, when he turns back to save Marcellus Wallace from a miserable fate."
}, {
  "movie": "Death Proof",
  "year": 2007,
  "rank": 22,
  "name": "Zoe Bell",
  "description": "It might seem a bit odd to call the stuntwoman’s first star turn a “character,” as the Death Proof daredevil seems to be basically a play on her real-life persona (even credited as ‘herself’). That said, it would also be criminal to overlook Bell’s incredible physical performance as the core of the exploitation homage’s electric nervous system."
}, {
  "movie": "Kill Bill",
  "year": 2003,
  "rank": 21,
  "name": "Elle Driver",
  "description": "Like an inverted image of O-Ren Ishii’s steely killer, Daryl Hannah’s spiteful, bitter hitwoman is the most devious and grimy nemesis Beatrix must face. Appropriately, their brutal battle is a wince-inducing highlight, and Hannah spits venom (“that’s right, I killed your master!”) as if inspired by the very sort of creature that presumably ends her life."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 20,
  "name": "Winston Wolf",
  "description": "Doing 100mph down the thin line between calculated poise and truly cool, Harvey Keitel plays the ultimate fixer who is also a surprisingly effective example of great management. We can intuit that the Wolf built his charmed life (what’s up with that 7am formal party?) using sheer force of will, and suspect he is one of the few Tarantino creations whose story might end well."
}, {
  "movie": "Death Proof",
  "year": 2007,
  "rank": 19,
  "name": "Abernathy",
  "description": "Kim’s the driver and de factor leader of the second-half girl gang in Death Proof, but film crew pro Abernathy is our surrogate whose horror turns into delight as Zoe Bell rides “ship’s mast” on their borrowed Dodge Charger. Tarantino’s sympathies are obviously with Abernathy from the moment the camera first lands on Rosario Dawson, and she even gets the unforgettable, merciless final strike against Stuntman Mike."
}, {
  "movie": "True Romance",
  "year": 1992,
  "rank": 18,
  "name": "Clarence",
  "description": "Tarantino wrote a few fantasy-fulfillment characters early on, and this young guy —Elvis fan, movie devotee, geek-store clerk— seems like a neon-sculpted writer’s alter-ego. Clever, determined and tender, Clarence is the nerd as male romantic ideal. But his impulsiveness and total lack of experience give Clarence just enough shortcomings to play as a legit personality."
}, {
  "movie": "True Romance",
  "year": 1993,
  "rank": 17,
  "name": "Alabama",
  "description": "It’s a lot easier to say “Alabama” than “manic pixie dream girl who kills James Gandolfini with a shotgun.” Here again, Tony Scott’s casting is right in sync with what Tarantino’s character requires, and Patricia Arquette brings an earnest presence to what could be a wish-fulfillment character."
}, {
  "movie": "Jackie Brown",
  "year": 1997,
  "rank": 16,
  "name": "Max Cherry",
  "description": "It’s a rare Tarantino character who is truly good, so this aging, idealistic bail bondsman played with reserved perfection by Robert Forster stands out as one of the few legit romantic heroes in a roster full of criminals and killers. Seemingly settled into a predictable life, Max is visibly shaken by Jackie Brown, and Forster effectively shows the collision between the calcification of age and the energy of a new love."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 15,
  "name": "Marcellus Wallace",
  "description": "The first shot of Ving Rhames as the LA crime boss in “Pulp Fiction” is a textbook example of an intriguing character setup. One simple detail (the band-aid, a piece of last-minute makeup work) hints at much more than dialogue can convey. Marcellus is great at making shady deals and ordering around goons like Jules and Vincent, but we’re left to wonder what’s really up with his marriage to Mia (they never speak). Some movie gangsters barely earn their screen time, but we’d watch a whole Marcellus movie in a snap."
}, {
  "movie": "Kill Bill",
  "year": 2003,
  "rank": 14,
  "name": "Bill",
  "description": "Only barely glimpsed in the first of the two movies bearing his name, Bill’s influence taints everything in Beatrix Kiddo’s life and death. His persona, the toxic ex revamped as a martial arts villain, doesn’t provide a typical action-movie punch, but is pitched just right for this story. David Carradine is an ideal choice for this abuser, and his showdown conversation with Beatrix is the most grand subversion in Tarantino’s ode to Hong Kong cinema."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 13,
  "name": "Mr Pink",
  "description": "The motormouthed Ego of “Reservoir Dogs” is probably irritating to be around, but he also has a habit of spitting truth. Sure, the guy is selfish and abrasive —it’s like he’s really the author’s purest mouthpiece, with just a bit of dialogue broken off to make Tarantino’s character Mr. Brown— but you can’t fault his assessment of the situation, and it’s easy to root for him when he gets a chance to protect himself one last time at the end of the movie."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 12,
  "name": "Hans Landa",
  "description": "As an experiment in making a supremely awful person nauseatingly charming, this Nazi officer is a rousing success. Landa’s commitment to his terrible role in human history isn’t even the worst part —it’s that he knows he is choosing to do terrible things. Christoph Waltz hasn’t yet topped the fusion of script and performance achieved in this breakout performance."
}, {
  "movie": "Django Unchained",
  "year": 2013,
  "rank": 11,
  "name": "Calvin Candie",
  "description": "Tarantino’s affinity for truly nasty villains bears diseased fruit in the form of this slaver, and Leonardo DiCaprio gives Candie a rich persona —he’s susceptible to flattery, willing to play a long con in his own interests, and is an astoundingly sore loser AND winner. There’s no liking Candie, but there’s also no arguing that he’s anything but a fully-formed whole."
}, {
  "movie": "Django Unchained",
  "year": 2012,
  "rank": 10,
  "name": "Stephen",
  "description": "As the mirror image of “Django Unchained”’s hero, Samuel L. Jackson bends and scrunches his frame to physically resemble the twisted morality of this perceptive and vindictive “servant.” Tarantino often conveys intrigue through dialogue, but Stephen’s dagger gaze is the most dangerous weapon in the film."
}, {
  "movie": "Django Unchained",
  "year": 2012,
  "rank": 9,
  "name": "Django",
  "description": "Revenge is a concept Tarantino has explored more than once, but freed slave Django doesn’t seek kill ’em all retribution. His desire is simple: a reunion with his wife. Any violence is a vengeful bonus. While he chafes at the idea of peaceably rescuing Broomhilda, he might have kept his weapons holstered if not for Stephen’s machinations. Fully unleashed, however, his righteous fury blazes bright."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 8,
  "name": "Vincent Vega",
  "description": "A cheeseball/addict/killer with barely-concealed confidence issues, John Travolta’s comeback gig is transfixing, and by virtue of the actor’s own verve, more than charismatic enough to convince us to accept Vega’s many rough edges. Even with all we know about Vincent, we’d want to hang out with the guy. His end, while pathetic and arguably justified, still generates a well of sympathy."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 7,
  "name": "Mia Wallace",
  "description": "A rich revamp of the “gangster moll” type, Uma Thurman’s character has all the best strengths of Tarantino’s writing: a rich story of her own, a kooky sense of humor, and the slight contradictions of people in our own lives. There’s a clear chemistry between Mia and Vincent, but counter to the standard from classic films, we get to see the two relating as equals rather than as potential sexual partners, despite whatever Vincent may be thinking at the end of the night."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 6,
  "name": "Mr. Orange",
  "description": "The optimism and naïveté of Tim Roth’s character, together with his easy rapport with Harvey Keitel and his deliberate positioning as an audience entry point, make him a key highlight in Reservoir Dogs His vulnerable bravura performance of a monologue designed to ingratiate Orange with the crooks —aided and abetted by camera and editing— really allow the undercover cop to become the movie’s complex hero."
}, {
  "movie": "Jackie Brown",
  "year": 1997,
  "rank": 5,
  "name": "Jackie Brown",
  "description": "40something and lacking any future prospects, Pam Grier’s Jackie Brown earns our respect for standing up to the shit thrown her way, and for daring to take a chance at the best retirement plan she’s ever going to get. It’s unfortuante that a character like Jackie is so rare in cinema, but Grier and Tarantino bring her to life as a fully-realized, nuanced woman."
}, {
  "movie": "Inglourious Basterds",
  "year": 2009,
  "rank": 4,
  "name": "Shoshanna",
  "description": "The tense opening of Inglorious Basterds sets up this Jewish refugee like a fairy tale heroine. She’s the young girl who escapes monsters before growing to confront them once again. With wit, intelligence and a reliable moral compass, Shoshanna is one of Tarantino’s most pure, even admirable creations."
}, {
  "movie": "Reservoir Dogs",
  "year": 1992,
  "rank": 3,
  "name": "Mr. White",
  "description": "A hardened criminal whose bluster hides a paternal quality, Harvey Keitel’s Mr. White, always ready to make more of a human connection than his job allows, is the most fascinating criminal in the motley crew in Reservoir Dogs He gives his trust utterly, especially when he’s on the upper end of a mentor/mentee relationship, and his keening anguish at Orange’s final confession is a tragic highlight of crime cinema."
}, {
  "movie": "Pulp Fiction",
  "year": 1994,
  "rank": 2,
  "name": "Jules",
  "description": "Using a bible verse (one mostly made up by Tarantino and Samuel L. Jackson) as pre-emptive eulogy for his victims is an ear-catching trick, but Jules is distinguished by his understanding of the difference between his public and private personas (let’s get into character) and the crisis of conscience ultimately created by his actions. Jules aspires to be a better person than he is, and achieves nobility by acting on his maturing beliefs."
}, {
  "movie": "Kill Bill",
  "year": 2003,
  "rank": 1,
  "name": "Beatrix Kiddo",
  "description": "As the primary focus of a two-film cycle, we see and learn more about Beatrix Kiddo, aka the Bride, than any other character in Tarantino’s pantheon. Her mission may be simple —revenge— but that mission is complicated by all the aspects of her life. She faces betrayals as a friend, partner, mother and a warrior. Just as the weight of Jules’ actions pushes him in a new direction, Beatrix recognizes the need for a life change, acts on it, and then faces the brutal task of destroying the ghosts of a past that isn’t ready to give her up. Beatrix is a vibrant depiction of maturity, played with astonishing dedication by Uma Thurman, a role that eclipses all many of the influences that played upon her creation."
}]
